# SystemClassification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystemType..::..SystemClassification Property
MEPSystemType Class See Also
---
Identifies the classification for the system type
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public MEPSystemClassification SystemClassification { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemClassification As MEPSystemClassification
	Get
```

Visual C++
---
```text
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
}
```

# Remarks
The system classification drives certain behavior such as sizing and connections to other systems
# See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace